In [1]:
#importing libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# importing house_price data

Data = pd.read_csv("house_prices.csv")

In [3]:
# coping the data

data = Data.copy()
data.head(2)

,Index,Title,Description,Amount(in rupees),Price (in rupees),location,Carpet Area,Status,Floor,Transaction,...,facing,overlooking,Society,Bathroom,Balcony,Car Parking,Ownership,Super Area,Dimensions,Plot Area
0,0,1 BHK Ready to Occupy Flat for sale in Srushti...,"Bhiwandi, Thane has an attractive 1 BHK Flat f...",42 Lac,6000.0,thane,500 sqft,Ready to Move,10 out of 11,Resale,...,NaN,NaN,Srushti Siddhi Mangal Murti Complex,1,2,NaN,NaN,NaN,NaN,NaN
1,1,2 BHK Ready to Occupy Flat for sale in Dosti V...,One can find this stunning 2 BHK flat for sale...,98 Lac,13799.0,thane,473 sqft,Ready to Move,3 out of 22,Resale,...,East,Garden/Park,Dosti Vihar,2,NaN,1 Open,Freehold,NaN,NaN,NaN

In [4]:
# checking data shape - (rows X columns)

data.shape

(187531, 21)

In [5]:
# Information about Raw data Each column  - (Non_null count,dtype)

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187531 entries, 0 to 187530
Data columns (total 21 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Index              187531 non-null  int64
 1   Title              187531 non-null  object
 2   Description        184508 non-null  object
 3   Amount(in rupees)  187531 non-null  object
 4   Price (in rupees)  169866 non-null  float64
 5   location           187531 non-null  object
 6   Carpet Area        106858 non-null  object
 7   Status             186916 non-null  object
 8   Floor              180454 non-null  object
 9   Transaction        187448 non-null  object
 10  Furnishing         184634 non-null  object
 11  facing             117298 non-null  object
 12  overlooking        106095 non-null  object
 13  Society            77853 non-null   object
 14  Bathroom           186703 non-null  object
 15  Balcony            138596 non-null  object
 16  Car Parking        84174 non-null   object
 17  Ownership          122014 non-null  object
 18  Super Area         79846 non-null   object
 19  Dimensions         0 non-null       float64
 20  Plot Area          0 non-null       float64
dtypes: float64(3), int64(1), object(17)
memory usage: 30.0+ MB

In [6]:
# checking for null values percentage count in each column

data.isna().sum()* 100 / len(data)

Index                  0.000000
Title                  0.000000
Description            1.612000
Amount(in rupees)      0.000000
Price (in rupees)      9.419776
location               0.000000
Carpet Area           43.018488
Status                 0.327946
Floor                  3.773776
Transaction            0.044259
Furnishing             1.544811
facing                37.451408
overlooking           43.425354
Society               58.485264
Bathroom               0.441527
Balcony               26.094352
Car Parking           55.114621
Ownership             34.936624
Super Area            57.422506
Dimensions           100.000000
Plot Area            100.000000
dtype: float64

# Data Cleaning

In [7]:
# removeing  unnecessary columns
# Inorder to clear unambiguity between rows

data.drop(["Index",'Description'],axis = 1,inplace= True)
data.shape

(187531, 19)

In [8]:
# checking for duplicate rows

data[data.duplicated() == True].shape

(120426, 19)

In [9]:
# duplicate data

data[data.duplicated() == True]

,Title,Amount(in rupees),Price (in rupees),location,Carpet Area,Status,Floor,Transaction,Furnishing,facing,overlooking,Society,Bathroom,Balcony,Car Parking,Ownership,Super Area,Dimensions,Plot Area
228,4 BHK Ready to Occupy Flat for sale in Hiranan...,3.20 Cr,17827.0,thane,1350 sqft,Ready to Move,16 out of 27,Resale,Unfurnished,East,Garden/Park,Hiranandani Meadows,3,1,2 Covered,Freehold,NaN,NaN,NaN
453,2 BHK Ready to Occupy Flat for sale in Cosmos ...,1 Cr,9091.0,thane,NaN,Ready to Move,8 out of 27,New Property,Semi-Furnished,NaN,NaN,Cosmos Horizon,2,NaN,NaN,NaN,1100 sqft,NaN,NaN
459,1 BHK Ready to Occupy Flat for sale Kasarvadavali,38 Lac,8837.0,thane,NaN,Ready to Move,4 out of 7,Resale,Unfurnished,NaN,NaN,NaN,1,NaN,NaN,NaN,430 sqft,NaN,NaN
494,2 BHK Ready to Occupy Flat for sale in Cosmos ...,1 Cr,9091.0,thane,NaN,Ready to Move,8 out of 27,New Property,Semi-Furnished,NaN,NaN,Cosmos Horizon,2,NaN,NaN,NaN,1100 sqft,NaN,NaN
495,2 BHK Ready to Occupy Flat for sale in Cosmos ...,1 Cr,9091.0,thane,NaN,Ready to Move,8 out of 27,New Property,Semi-Furnished,NaN,NaN,Cosmos Horizon,2,NaN,NaN,NaN,1100 sqft,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
187422,3 BHK Ready to Occupy Flat for sale Ambala Hig...,63.9 Lac,3277.0,zirakpur,1350 sqft,Ready to Move,2 out of 4,New Property,Semi-Furnished,North - East,"Garden/Park, Pool, Main Road",NaN,3,2,"1 Covered,",Freehold,NaN,NaN,NaN
187423,3 BHK Ready to Occupy Flat for sale Ambala Hig...,63.9 Lac,3277.0,zirakpur,1350 sqft,Ready to Move,2 out of 4,New Property,Semi-Furnished,North - East,"Garden/Park, Pool, Main Road",NaN,3,2,"1 Covered,",Freehold,NaN,NaN,NaN
187424,3 BHK Ready to Occupy Flat for sale in Elanza ...,73.9 Lac,4322.0,zirakpur,900 sqft,Ready to Move,2 out of 4,New Property,Semi-Furnished,East,"Garden/Park, Main Road",Elanza,3,2,1 Covered,Freehold,NaN,NaN,NaN
187482,3 BHK Ready to Occupy Flat for sale in Highlan...,52.9 Lac,3833.0,zirakpur,NaN,Ready to Move,3 out of 3,New Property,Semi-Furnished,East,Garden/Park,Highland Park Homes,3,2,1 Covered,Freehold,1380 sqft,NaN,NaN
187487,3 BHK Ready to Occupy Flat for sale in Highlan...,52.9 Lac,3833.0,zirakpur,NaN,Ready to Move,3 out of 3,New Property,Semi-Furnished,East,Garden/Park,Highland Park Homes,3,2,1 Covered,Freehold,1380 sqft,NaN,NaN

In [10]:
# taking one title name from duplicate values to view duplicates and verify

data.iloc[228,0]

'4 BHK Ready to Occupy Flat for sale in Hiranandani Meadows Manpada Thane West'

In [11]:
# checking duplicate values are correct or not
# duplicate rows are not adjascent each other,Here i am using head(2) i know that duplicates next to each here only 

data[data['Title'] == '4 BHK Ready to Occupy Flat for sale in Hiranandani Meadows Manpada Thane West'].head(2)

,Title,Amount(in rupees),Price (in rupees),location,Carpet Area,Status,Floor,Transaction,Furnishing,facing,overlooking,Society,Bathroom,Balcony,Car Parking,Ownership,Super Area,Dimensions,Plot Area
30,4 BHK Ready to Occupy Flat for sale in Hiranan...,3.20 Cr,17827.0,thane,1350 sqft,Ready to Move,16 out of 27,Resale,Unfurnished,East,Garden/Park,Hiranandani Meadows,3,1,2 Covered,Freehold,NaN,NaN,NaN
228,4 BHK Ready to Occupy Flat for sale in Hiranan...,3.20 Cr,17827.0,thane,1350 sqft,Ready to Move,16 out of 27,Resale,Unfurnished,East,Garden/Park,Hiranandani Meadows,3,1,2 Covered,Freehold,NaN,NaN,NaN

In [12]:
# removing duplicate rows

data.drop_duplicates(keep = 'first',inplace = True)

In [13]:
# with duplicates      187531
# without duplicates - 120426 
#                      67105

data.shape

(67105, 19)

In [14]:
# removing unwatend columns and Total null values column for Analysis

data.drop(['Price (in rupees)','Society','Dimensions','Plot Area'],axis = 1, inplace = True)
data.shape

(67105, 15)

In [15]:
data.isna().sum()

Title                    0
Amount(in rupees)        0
location                 0
Carpet Area          29576
Status                 299
Floor                 2541
Transaction             78
Furnishing            1264
facing               26406
overlooking          29100
Bathroom               450
Balcony              18708
Car Parking          38851
Ownership            24559
Super Area           37653
dtype: int64

In [16]:
# checking for null values percentage count in each column

data.isna().sum()* 100 / len(data)

Title                 0.000000
Amount(in rupees)     0.000000
location              0.000000
Carpet Area          44.074212
Status                0.445570
Floor                 3.786603
Transaction           0.116236
Furnishing            1.883615
facing               39.350272
overlooking          43.364876
Bathroom              0.670591
Balcony              27.878698
Car Parking          57.895835
Ownership            36.597869
Super Area           56.110573
dtype: float64

In [17]:
data.head()

,Title,Amount(in rupees),location,Carpet Area,Status,Floor,Transaction,Furnishing,facing,overlooking,Bathroom,Balcony,Car Parking,Ownership,Super Area
0,1 BHK Ready to Occupy Flat for sale in Srushti...,42 Lac,thane,500 sqft,Ready to Move,10 out of 11,Resale,Unfurnished,NaN,NaN,1,2,NaN,NaN,NaN
1,2 BHK Ready to Occupy Flat for sale in Dosti V...,98 Lac,thane,473 sqft,Ready to Move,3 out of 22,Resale,Semi-Furnished,East,Garden/Park,2,NaN,1 Open,Freehold,NaN
2,2 BHK Ready to Occupy Flat for sale in Sunrise...,1.40 Cr,thane,779 sqft,Ready to Move,10 out of 29,Resale,Unfurnished,East,Garden/Park,2,NaN,1 Covered,Freehold,NaN
3,1 BHK Ready to Occupy Flat for sale Kasheli,25 Lac,thane,530 sqft,Ready to Move,1 out of 3,Resale,Unfurnished,NaN,NaN,1,1,NaN,NaN,NaN
4,2 BHK Ready to Occupy Flat for sale in TenX Ha...,1.60 Cr,thane,635 sqft,Ready to Move,20 out of 42,Resale,Unfurnished,West,"Garden/Park, Main Road",2,NaN,1 Covered,Co-operative Society,NaN

## Column wise cleaning and transformation

__Cleaning traget column -- Amount(in rupees)__

1. Transforming text into numerical column.
2. removing odd text

In [18]:
data['Amount(in rupees)'].unique()[:10]

array(['42 Lac ', '98 Lac ', '1.40 Cr ', '25 Lac ', '1.60 Cr ', '45 Lac ',
       '16.5 Lac ', '60 Lac ', '1.36 Cr ', '1.35 Cr '], dtype=object)

In [19]:
# find that is there any text in traget column instead of price

data[~data['Amount(in rupees)'].str.contains(r"(\d\s*)",case = False)]['Amount(in rupees)'].unique()

C:\Users\sivak\AppData\Local\Temp\ipykernel_36908\749427666.py:3: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  data[~data['Amount(in rupees)'].str.contains(r"(\d\s*)",case = False)]['Amount(in rupees)'].unique()

array(['Call for Price'], dtype=object)

In [20]:
# removing rows based on Amount(in rupees) text --'Call for Price'--

data = data[data['Amount(in rupees)'].str.contains(r"(\d\s*)",case = False)]

C:\Users\sivak\AppData\Local\Temp\ipykernel_36908\1714493268.py:3: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  data = data[data['Amount(in rupees)'].str.contains(r"(\d\s*)",case = False)]

In [21]:
# Before removing - 67105
# After removing - 64208
data.shape

(64208, 15)

In [22]:
# conversation function

def text_numbers(text):
    value = text.strip().lower()
    if "lac" in value : 
        return float(value.replace('lac','').strip())*100000
    elif 'cr' in value :
        return float(value.replace('cr','').strip())*10000000
    else :
        return float(value)

In [23]:
# transforming text into float

data['Amount(in rupees)'] = data['Amount(in rupees)'].apply(text_numbers)

In [24]:
# checking column transformed or not

data['Amount(in rupees)'].dtype

dtype('float64')

In [25]:
data['Amount(in rupees)'].sort_values(ascending = False)

181234    1.400300e+10
176536    5.100400e+09
174894    3.967500e+09
175013    2.298000e+09
183303    8.000000e+08
              ...
164988    1.100000e+05
148933    1.000000e+05
165328    1.000000e+05
180482    1.000000e+05
173924    1.000000e+05
Name: Amount(in rupees), Length: 64208, dtype: float64

In [26]:
data[data['Amount(in rupees)']<=2000000000]['Amount(in rupees)'].count()

64204

__Title Column__

1. Removing other text in title and extracting title only.

In [27]:
data['Title'].unique()[:10]

array(['1 BHK Ready to Occupy Flat for sale in Srushti Siddhi Mangal Murti Complex Bhiwandi',
       '2 BHK Ready to Occupy Flat for sale in Dosti Vihar Pokhran Road',
       '2 BHK Ready to Occupy Flat for sale in Sunrise by Kalpataru Kolshet Road',
       '1 BHK Ready to Occupy Flat for sale Kasheli',
       '2 BHK Ready to Occupy Flat for sale in TenX Habitat Raymond Realty Pokhran Road',
       '1 BHK Ready to Occupy Flat for sale in Virat Aangan Titwala',
       '1 BHK Ready to Occupy Flat for sale Mumbra',
       '1 BHK Ready to Occupy Flat for sale Kalwa',
       '3 BHK Ready to Occupy Flat for sale in Pride Palms Kolshet',
       '3 BHK Ready to Occupy Flat for sale in Cosmos Lounge Manpada Thane West'],
      dtype=object)

In [28]:
# triming extra space of the text

data['Title'] = data['Title'].str.replace(r'(\s+)',' ',regex = True).str.strip()

In [29]:
# trim the extra text in title column keeping precise

d= data['Title'].str.strip().str.extract(r'(?i)(\d+\s*BHK)',expand = False)
d.fillna(data[~data['Title'].str.strip().str.contains(r'(?i)(\d+\s*BHK)',case = False)]["Title"].str.strip(" ").str.split(" ").str[0],inplace= True)

data['Title']=d

C:\Users\sivak\AppData\Local\Temp\ipykernel_36908\774476106.py:4: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  d.fillna(data[~data['Title'].str.strip().str.contains(r'(?i)(\d+\s*BHK)',case = False)]["Title"].str.strip(" ").str.split(" ").str[0],inplace= True)

In [30]:
data['Title'].unique()

array(['1 BHK', '2 BHK', '3 BHK', '4 BHK', '5 BHK', 'Studio', '6 BHK',
       'Apartment', '8 BHK', '7 BHK', '10 BHK', '9 BHK', 'Builder'],
      dtype=object)

__Location Column__

In [31]:
data['location'].isna().sum()

0

In [32]:
data['location'].unique()

array(['thane', 'navi-mumbai', 'nagpur', 'mumbai', 'ahmedabad',
       'bangalore', 'chennai', 'gurgaon', 'hyderabad', 'indore', 'jaipur',
       'kolkata', 'lucknow', 'new-delhi', 'noida', 'pune', 'agra',
       'ahmadnagar', 'allahabad', 'aurangabad', 'badlapur', 'belgaum',
       'bhiwadi', 'bhiwandi', 'bhopal', 'bhubaneswar', 'chandigarh',
       'coimbatore', 'dehradun', 'durgapur', 'ernakulam', 'faridabad',
       'ghaziabad', 'goa', 'greater-noida', 'guntur', 'guwahati',
       'gwalior', 'haridwar', 'jabalpur', 'jamshedpur', 'jodhpur',
       'kalyan', 'kanpur', 'kochi', 'kozhikode', 'ludhiana', 'madurai',
       'mangalore', 'mohali', 'mysore', 'nashik', 'navsari', 'nellore',
       'palakkad', 'palghar', 'panchkula', 'patna', 'pondicherry',
       'raipur', 'rajahmundry', 'ranchi', 'satara', 'shimla', 'siliguri',
       'solapur', 'sonipat', 'surat', 'thrissur', 'tirupati', 'trichy',
       'trivandrum', 'udaipur', 'udupi', 'vadodara', 'vapi', 'varanasi',
       'vijayawada', 'visakhapatnam', 'vrindavan', 'zirakpur'],
      dtype=object)

__Carpet Area Column__

1.Based on tile filling null values with averages
2.tranforming text data to ineger

In [33]:
data['Carpet Area'].isna().sum()

28078

In [34]:
# removing space on both sides of text

data['Carpet Area'] = data['Carpet Area'].str.strip()

In [35]:
# remove sqft in carpet area column and filling null values with average

d = data['Carpet Area'].str.extract(r'(\d+)',expand = False)
d = d.astype('float64')
d = pd.concat([d,data['Title']],axis = 1)
title_avg_values = d.groupby(['Title'])['Carpet Area'].mean()
title_avg_values = title_avg_values.fillna(0)
d['Carpet Area'] = d['Carpet Area'].fillna(d['Title'].map(title_avg_values))
d.drop(['Title'],axis = 1,inplace = True)
data['Carpet Area'] = d

In [36]:
title_avg_values

Title
1 BHK         488.893838
10 BHK       6568.062500
2 BHK         966.058970
3 BHK        1366.226204
4 BHK        2174.797118
5 BHK        3178.393393
6 BHK        4216.166667
7 BHK        3184.375000
8 BHK        5448.500000
9 BHK           0.000000
Apartment     562.500000
Builder         0.000000
Studio        572.165468
Name: Carpet Area, dtype: float64

__Status Column__

In [37]:
data['Status'].isna().sum()

279

In [38]:
data['Status'].unique()

array(['Ready to Move', nan], dtype=object)

In [39]:
data['Status'] = data['Status'].fillna("Not Mentioned")

In [40]:
data['Status'].unique()

array(['Ready to Move', 'Not Mentioned'], dtype=object)

__Floor Column__

1. Filling null values with avg based on title

In [41]:
data['Floor'].isna().sum()

2431

In [42]:
# removing extra spaces and making it into single space separators

data['Floor'] = data['Floor'].str.strip()
data['Floor'].replace(r"\s+",' ',regex = True,inplace = True)

C:\Users\sivak\AppData\Local\Temp\ipykernel_36908\3984854070.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Floor'].replace(r"\s+",' ',regex = True,inplace = True)

In [43]:
# spliting into two columns 

d = data['Floor'].str.split('out of',expand = True,n = 1)

In [44]:
# converting floor names into numbers


def Floor_text_to_num(text):
    value = str(text).strip().lower()
    if 'upper basement' in value:
        return '-1'
    elif 'lower basement' in value:
        return "-2"
    elif 'ground' in value :
        return '0'
    elif value in ('nan','None','none'):
        return np.nan
    else : 
        return value.strip()

In [45]:
# applying convertion function

d[0] = d[0].apply(Floor_text_to_num)

In [46]:
# applying convertion function

d[1] = d[1].apply(Floor_text_to_num)

In [47]:
# converting data types

d[0] = d[0].astype('float64')
d[1] = d[1].astype('float64')

In [48]:
# filling null values with average values based on title

d = pd.concat([d[0],d[1],data['Title']],axis = 1)
cur_floor = d.groupby(['Title'])[1].mean()
tot_floor = d.groupby(['Title'])[1].max()

d[0] = d[0].fillna(d['Title'].map(cur_floor))
d[1] = d[1].fillna(d['Title'].map(tot_floor))

In [49]:
cur_floor

Title
1 BHK         6.674358
10 BHK        8.111111
2 BHK         7.982617
3 BHK         9.113831
4 BHK        10.346309
5 BHK        11.796512
6 BHK        10.433735
7 BHK        17.071429
8 BHK        21.000000
9 BHK         3.714286
Apartment    10.000000
Builder      17.000000
Studio        9.267399
Name: 1, dtype: float64

In [50]:
tot_floor

Title
1 BHK         72.0
10 BHK        50.0
2 BHK        200.0
3 BHK         91.0
4 BHK         77.0
5 BHK         76.0
6 BHK         91.0
7 BHK         85.0
8 BHK         63.0
9 BHK          5.0
Apartment     14.0
Builder       17.0
Studio        45.0
Name: 1, dtype: float64

In [51]:
d.isna().sum()

0        0
1        0
Title    0
dtype: int64

In [52]:
# converting data types

d[0] = d[0].astype('int64')
d[1] = d[1].astype('int64')

In [53]:
d[0].unique()

array([ 10,   3,   1,  20,   2,   4,   0,   6,  16,   8,  18,   5,  15,
        27,  11,   9,  14,  12,   7,  21,  -1,  29,  13,  19,  17,  28,
        30,  23,  25,  26,  24,  22,  32,  33,  -2,  40,  35,  42,  63,
        38,  34,  60,  31,  37,  75,  70,  39,  44,  46,  36,  59,  45,
        51,  50, 200], dtype=int64)

In [54]:
d[1].unique()

array([ 11,  22,  29,   3,  42,   7,   5,   2,  27,  20,  24,  16,  28,
        31,   8,  17,   4,  38,  19,   9,  12,  10,  30,  18,  26,  32,
        25,  14, 200,   6,  15,  13,  35,  23,   1,  21,  36,  40,  72,
        45,  91,  33,  34,  37,  39,  76,  77,  88,  55,  51,  44,  60,
        54,  58,  68,  67,  41,  56,  63,  52,  47,  48,  85,  78,  43,
        53,  50,  75,  61,  46,  84, 150,  70], dtype=int64)

In [55]:
d.drop(['Title'],axis = 1,inplace = True)
d

         0   1
0       10  11
1        3  22
2       10  29
3        1   3
4       20  42
...     ..  ..
187526   2   4
187527   4   6
187528   1   3
187529   2   2
187530   5  13

[64208 rows x 2 columns]

In [56]:
# chaning column names

d.columns = ['Current_Floor','Total_Floors']

In [57]:
# concat transformed floor data based to original dataframe data

data = pd.concat([data.iloc[:,:data.columns.get_loc('Floor')+1],d,data.iloc[:,data.columns.get_loc('Floor')+1:]],axis = 1)

In [58]:
# Droping Floor column from data

data.drop(['Floor'],inplace = True,axis = 1)

__Transaction Column__

In [59]:
# checking unique values

data['Transaction'].unique()

array(['Resale', 'New Property', nan, 'Other', 'Rent/Lease'], dtype=object)

In [60]:
# filling null values with 'Not Specified text'

data['Transaction'] = data['Transaction'].fillna('Not Specified')

In [61]:
data['Transaction'].unique()

array(['Resale', 'New Property', 'Not Specified', 'Other', 'Rent/Lease'],
      dtype=object)

__Furnishing__

In [62]:
data['Furnishing'].unique()

array(['Unfurnished', 'Semi-Furnished', 'Furnished', nan], dtype=object)

In [63]:
# filling null values with 'Not-Mentioned'

data['Furnishing'] = data['Furnishing'].fillna('Not-Mentioned')

In [64]:
data['Furnishing'].unique()

array(['Unfurnished', 'Semi-Furnished', 'Furnished', 'Not-Mentioned'],
      dtype=object)

__facing__

In [65]:
data['facing'].unique()

array([nan, 'East', 'West', 'North - East', 'North', 'North - West',
       'South', 'South -West', 'South - East'], dtype=object)

In [66]:
# filling null values with '0'

data['facing'] = data['facing'].fillna('0')

In [67]:
data['facing'].unique()

array(['0', 'East', 'West', 'North - East', 'North', 'North - West',
       'South', 'South -West', 'South - East'], dtype=object)

__Overlooking__

In [68]:
data['overlooking'].isna().sum()

27318

In [69]:
data['overlooking'].unique()

array([nan, 'Garden/Park', 'Garden/Park, Main Road', 'Main Road',
       'Pool, Garden/Park, Main Road', 'Garden/Park, Pool, Main Road',
       'Garden/Park, Pool', 'Main Road, Garden/Park',
       'Main Road, Garden/Park, Pool', 'Pool, Garden/Park', 'Pool',
       'Garden/Park, Main Road, Pool', 'Pool, Main Road',
       'Main Road, Pool, Garden/Park', 'Pool, Main Road, Garden/Park',
       'Main Road, Not Available', 'Main Road, Pool',
       'Garden/Park, Not Available', 'Pool, Main Road, Not Available'],
      dtype=object)

In [70]:
# sorting values based on first or each text
# removing "Not Available"

def sortvalues(text):
    if pd.isna(text):
        return text
    items = [i.strip() for i in text.split(',')]
    if "Not Available" in items:
        items.remove("Not Available")
    items.sort(key = lambda x : x[0].lower())
    return ','.join(items)

In [71]:
# applying sortvalues function

data['overlooking'] = data['overlooking'].apply(sortvalues)

In [72]:
# filling null values with 'Space'

data['overlooking'] = data['overlooking'].fillna("Space")

In [73]:
data['overlooking'].unique()

array(['Space', 'Garden/Park', 'Garden/Park,Main Road', 'Main Road',
       'Garden/Park,Main Road,Pool', 'Garden/Park,Pool', 'Pool',
       'Main Road,Pool'], dtype=object)

__Bathroom Column__

In [74]:
data['Bathroom'].unique()

array(['1', '2', '3', '4', '6', nan, '5', '9', '8', '> 10', '7', '10'],
      dtype=object)

In [75]:
# filling null values with '0'

data['Bathroom'] = data['Bathroom'].fillna(0)

In [76]:
d = data[data['Bathroom'] != '> 10']['Bathroom']
d = d.astype('float64')

In [77]:
# filling > 10 with  10 + avg of (exclude > 10)

data['Bathroom'] = np.where(data['Bathroom'] == '> 10',10+round(d.mean(),0),data['Bathroom'])

In [78]:
data['Bathroom'].unique()

array(['1', '2', '3', '4', '6', 0, '5', '9', '8', 12.0, '7', '10'],
      dtype=object)

In [79]:
data['Bathroom'] = data['Bathroom'].astype('int64')

__Balcony Column__

In [80]:
data['Balcony'].unique()

array(['2', nan, '1', '3', '4', '6', '5', '7', '> 10', '10', '8', '9'],
      dtype=object)

In [81]:
data['Balcony'] = data['Balcony'].fillna('0')

In [82]:
# filling > 10 with  10 + avg of (exclude > 10)

data['Balcony'] = np.where(data['Balcony'] == '> 10',10+round(d.mean(),0),data['Balcony'])

In [83]:
data['Balcony'] = data['Balcony'].astype('int64')

__Car Parking__

In [84]:
data['Car Parking'].isna().sum()

36889

In [85]:
d = data['Car Parking'].str.strip().str.extract(r'(\d+)\s*(Covered|Open)', expand=True)
d["Covered_Parking"] = np.where(d[1] == "Covered",d[0],np.nan)
d["Open_Parking"] = np.where(d[1] == 'Open',d[0],np.nan)

In [86]:
d['Open_Parking'].isna().sum()

60461

In [87]:
d

          0        1 Covered_Parking Open_Parking
0       NaN      NaN             NaN          NaN
1         1     Open             NaN            1
2         1  Covered               1          NaN
3       NaN      NaN             NaN          NaN
4         1  Covered               1          NaN
...     ...      ...             ...          ...
187526    1  Covered               1          NaN
187527    1  Covered               1          NaN
187528    1  Covered               1          NaN
187529  NaN      NaN             NaN          NaN
187530    1  Covered               1          NaN

[64208 rows x 4 columns]

In [88]:
d.drop([0,1],axis = 1,inplace = True)

In [89]:
d = pd.concat([d['Covered_Parking'],d['Open_Parking'],data['Title']],axis = 1)

In [223]:
d

         Super Area
0        543.529539
1        987.789205
2        987.789205
3        543.529539
4        987.789205
...             ...
187526  1953.000000
187527  1680.000000
187528  1570.225804
187529   709.000000
187530  1915.000000

[64208 rows x 1 columns]

In [91]:
# converting data type into float and filling null values with avg

d['Open_Parking'] = d['Open_Parking'].astype('float64')
d["Covered_Parking"] = d["Covered_Parking"].astype('float64')

op_avg = d.groupby('Title')['Open_Parking'].mean()
cp_avg = d.groupby('Title')['Covered_Parking'].mean()

op_avg = op_avg.fillna(0)
cp_avg = cp_avg.fillna(0)

d['Open_Parking'] = d['Open_Parking'].fillna(d['Title'].map(op_avg))
d["Covered_Parking"] = d["Covered_Parking"].fillna(d['Title'].map(cp_avg))

# converting into integer
d['Open_Parking'] = d['Open_Parking'].astype('int64')
d["Covered_Parking"] = d["Covered_Parking"].astype('int64')

In [92]:
op_avg

Title
1 BHK        7.811419
10 BHK       8.000000
2 BHK        7.374168
3 BHK        4.758321
4 BHK        2.085106
5 BHK        1.692308
6 BHK        4.500000
7 BHK        3.000000
8 BHK        0.000000
9 BHK        0.000000
Apartment    1.000000
Builder      0.000000
Studio       4.483871
Name: Open_Parking, dtype: float64

In [93]:
d.drop("Title",axis = 1,inplace = True)
d

        Covered_Parking  Open_Parking
0                     6             7
1                     4             1
2                     1             7
3                     6             7
4                     1             7
...                 ...           ...
187526                1             4
187527                1             4
187528                1             4
187529                4             7
187530                1             4

[64208 rows x 2 columns]

In [94]:
data.columns.get_loc('Car Parking')

13

In [95]:
data = pd.concat([data.iloc[:,:data.columns.get_loc('Car Parking')+1],d,data.iloc[:,data.columns.get_loc('Car Parking')+1:]],axis = 1)

In [96]:
data.drop('Car Parking',axis = 1,inplace = True)

In [97]:
data.head()

,Title,Amount(in rupees),location,Carpet Area,Status,Current_Floor,Total_Floors,Transaction,Furnishing,facing,overlooking,Bathroom,Balcony,Covered_Parking,Open_Parking,Ownership,Super Area
0,1 BHK,4200000.0,thane,500.0,Ready to Move,10,11,Resale,Unfurnished,0,Space,1,2,6,7,NaN,NaN
1,2 BHK,9800000.0,thane,473.0,Ready to Move,3,22,Resale,Semi-Furnished,East,Garden/Park,2,0,4,1,Freehold,NaN
2,2 BHK,14000000.0,thane,779.0,Ready to Move,10,29,Resale,Unfurnished,East,Garden/Park,2,0,1,7,Freehold,NaN
3,1 BHK,2500000.0,thane,530.0,Ready to Move,1,3,Resale,Unfurnished,0,Space,1,1,6,7,NaN,NaN
4,2 BHK,16000000.0,thane,635.0,Ready to Move,20,42,Resale,Unfurnished,West,"Garden/Park,Main Road",2,0,1,7,Co-operative Society,NaN

__Ownership Column__

In [98]:
data['Ownership'].unique()

array([nan, 'Freehold', 'Co-operative Society', 'Power Of Attorney',
       'Leasehold'], dtype=object)

In [99]:
# filling null values with 'No Info'

data['Ownership'] = data['Ownership'].fillna('No Info')

In [100]:
data['Ownership'].unique()

array(['No Info', 'Freehold', 'Co-operative Society', 'Power Of Attorney',
       'Leasehold'], dtype=object)

__Super Area__

In [101]:
data['Super Area'].unique()

array([nan, '680 sqft', '575 sqft', ..., '2066 sqft', '406 sqft',
       '2332 sqft'], dtype=object)

In [102]:
# removing spaces over the text

data['Super Area'] = data['Super Area'].str.strip()

In [103]:
# remove sqft in carpet area column and filling null values with average

d = data['Super Area'].str.extract(r'(\d+)',expand = False)
d = d.astype('float64')
d = pd.concat([d,data['Title']],axis = 1)
super_title_avg = d.groupby('Title')['Super Area'].mean()
d['Super Area'] = d['Super Area'].fillna(d['Title'].map(super_title_avg))
d.drop('Title',axis = 1,inplace = True)
data['Super Area'] = d

In [104]:
super_title_avg

Title
1 BHK         543.529539
10 BHK       3017.450000
2 BHK         987.789205
3 BHK        1570.225804
4 BHK        2730.419435
5 BHK        3964.594203
6 BHK        3262.595238
7 BHK        4463.375000
8 BHK        4090.428571
9 BHK        3088.285714
Apartment    3059.000000
Builder       555.000000
Studio        415.920863
Name: Super Area, dtype: float64

In [105]:
data.isna().sum()

Title                0
Amount(in rupees)    0
location             0
Carpet Area          0
Status               0
Current_Floor        0
Total_Floors         0
Transaction          0
Furnishing           0
facing               0
overlooking          0
Bathroom             0
Balcony              0
Covered_Parking      0
Open_Parking         0
Ownership            0
Super Area           0
dtype: int64

  __columns      -     Null values filler__

1. Carpet Area		-    average(as per title) - (float)
2. Status			-    'Not Mentioned'
3. Current_Floor	-	 average(as per title) - float
4. Total_Floors	    -	 max(as per title) - float
5. Transaction		-    'Not Specified'
6. Furnishing		-    'Not-Mentioned'
7. Facing			-    '0'
8. Overlooking		-    'Space'
9. Bathroom		    -    0
10. Balcony			-    0
11. Covered_Parking	-	 average(as per title) - float
12. Open_Parking	-	 average(as per title) - float
13. Ownership		-    'No Info'

In [224]:
data.isna().sum()

Title                0
Amount(in rupees)    0
Location             0
Carpet_Area          0
Status               0
Current_Floor        0
Total_Floors         0
Transaction          0
Furnishing           0
Facing               0
Overlooking          0
Bathroom             0
Balcony              0
Covered_Parking      0
Open_Parking         0
Ownership            0
Super_Area           0
dtype: int64

In [107]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 64208 entries, 0 to 187530
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Title              64208 non-null  object
 1   Amount(in rupees)  64208 non-null  float64
 2   location           64208 non-null  object
 3   Carpet Area        64208 non-null  float64
 4   Status             64208 non-null  object
 5   Current_Floor      64208 non-null  int64
 6   Total_Floors       64208 non-null  int64
 7   Transaction        64208 non-null  object
 8   Furnishing         64208 non-null  object
 9   facing             64208 non-null  object
 10  overlooking        64208 non-null  object
 11  Bathroom           64208 non-null  int64
 12  Balcony            64208 non-null  int64
 13  Covered_Parking    64208 non-null  int64
 14  Open_Parking       64208 non-null  int64
 15  Ownership          64208 non-null  object
 16  Super Area         64208 non-null  float64
dtypes: float64(3), int64(6), object(8)
memory usage: 8.8+ MB

In [108]:
# column Names converstion into Camel case

column_names = {'location': 'Location','facing':'Facing','overlooking':'Overlooking','Super Area':'Super_Area','Carpet Area':'Carpet_Area'}
data.rename(columns=column_names,inplace = True)

### Saving clean data file

In [109]:
data.to_csv('Clean_House_price_data.csv',index = False,sep = ',')